import React, { useState } from "react";
import s from "@/views/News/News.module.scss";

function NewsCard({ item, id }) {
  const [isOpenCard, setIsOpenCard] = useState(false);

  return (
    <div className={`${s.news__wrapper_left_item} ${isOpenCard && s.active}`}>
      <div className={s.news__wrapper_left_review}>
        <button
          className={s.news__wrapper_left_review_close}
          onClick={() => setIsOpenCard(false)}
        >
          <svg
            width="20"
            height="20"
            viewBox="0 0 20 20"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              d="M11.8323 10.0163L19.6199 2.22846C20.1267 1.7219 20.1267 0.902849 19.6199 0.396282C19.1134 -0.110284 18.2943 -0.110284 17.7878 0.396282L9.9999 8.18412L2.21229 0.396282C1.70548 -0.110284 0.886671 -0.110284 0.380103 0.396282C-0.126701 0.902849 -0.126701 1.7219 0.380103 2.22846L8.16772 10.0163L0.380103 17.8041C-0.126701 18.3107 -0.126701 19.1298 0.380103 19.6363C0.632557 19.889 0.964495 20.016 1.2962 20.016C1.6279 20.016 1.9596 19.889 2.21229 19.6363L9.9999 11.8485L17.7878 19.6363C18.0404 19.889 18.3721 20.016 18.7038 20.016C19.0355 20.016 19.3672 19.889 19.6199 19.6363C20.1267 19.1298 20.1267 18.3107 19.6199 17.8041L11.8323 10.0163Z"
              fill="white"
            />
          </svg>
        </button>
        <div className={s.news__wrapper_left_review_title}>
          Реализация намеченных плановых заданий - интересный эксперимент
          проверки модели развития.
        </div>
        <div className={s.news__wrapper_left_review_text}>
          Прежде всего, реализация намеченных плановых заданий представляет
          собой интересный эксперимент проверки модели развития. Значимость этих
          проблем настолько очевидна, что семантический разбор внешних
          противодействий однозначно определяет каждого участника.
        </div>
        <div className={s.news__wrapper_left_review_buttons}>
          <a href="/" className={s.download}>
            Скачать (pdf.)
            <span>
              <svg
                width="21"
                height="21"
                viewBox="0 0 21 21"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M9.73805 16.2936C9.83817 16.3937 9.95702 16.4731 10.0878 16.5273C10.2186 16.5815 10.3588 16.6094 10.5004 16.6094C10.642 16.6094 10.7822 16.5815 10.913 16.5273C11.0438 16.4731 11.1627 16.3937 11.2628 16.2936L15.3286 12.2277C15.5308 12.0256 15.6444 11.7513 15.6444 11.4654C15.6444 11.1795 15.5308 10.9052 15.3286 10.703C15.1264 10.5009 14.8522 10.3873 14.5663 10.3873C14.2803 10.3873 14.0061 10.5009 13.8039 10.703L11.5785 12.9284V1.15625C11.5785 0.870313 11.465 0.596088 11.2628 0.393901C11.0606 0.191713 10.7864 0.078125 10.5004 0.078125C10.2145 0.078125 9.94026 0.191713 9.73807 0.393901C9.53588 0.596088 9.4223 0.870313 9.4223 1.15625V12.9284L7.19691 10.703C6.99472 10.5009 6.7205 10.3873 6.43456 10.3873C6.14863 10.3873 5.87441 10.5009 5.67222 10.703C5.47003 10.9052 5.35645 11.1795 5.35645 11.4654C5.35645 11.7513 5.47003 12.0256 5.67222 12.2277L9.73805 16.2936Z"
                  fill="#FF6A39"
                />
                <path
                  d="M19.8438 9.42188C19.5578 9.42188 19.2836 9.53546 19.0814 9.73765C18.8792 9.93984 18.7656 10.2141 18.7656 10.5V18.7656H2.23438V10.5C2.23438 10.2141 2.12079 9.93984 1.9186 9.73765C1.71641 9.53546 1.44219 9.42188 1.15625 9.42188C0.870313 9.42188 0.596088 9.53546 0.393901 9.73765C0.191713 9.93984 0.078125 10.2141 0.078125 10.5V19.125C0.078125 19.6016 0.267438 20.0586 0.604418 20.3956C0.941397 20.7326 1.39844 20.9219 1.875 20.9219H19.125C19.6016 20.9219 20.0586 20.7326 20.3956 20.3956C20.7326 20.0586 20.9219 19.6016 20.9219 19.125V10.5C20.9219 10.2141 20.8083 9.93984 20.6061 9.73765C20.4039 9.53546 20.1297 9.42188 19.8438 9.42188Z"
                  fill="#FF6A39"
                />
              </svg>
            </span>
          </a>

          <button className={s.news__wrapper_left_review_market}>
            Обзоры рынка
          </button>
        </div>
      </div>

      <div className={s.news__wrapper_left_main}>
        <div className={s.news__wrapper_left_date}>{item.date}</div>
        <div className={s.news__wrapper_left_title}>{item.title}</div>
        <a
          href="/"
          className={s.news__wrapper_left_more}
          onClick={(e) => {
            e.preventDefault();
            setIsOpenCard(true);
          }}
        >
          Подробнее
          <span>
            <svg
              width="17"
              height="8"
              viewBox="0 0 17 8"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M16.3536 4.35355C16.5488 4.15829 16.5488 3.84171 16.3536 3.64645L13.1716 0.464466C12.9763 0.269204 12.6597 0.269204 12.4645 0.464466C12.2692 0.659728 12.2692 0.976311 12.4645 1.17157L15.2929 4L12.4645 6.82843C12.2692 7.02369 12.2692 7.34027 12.4645 7.53553C12.6597 7.7308 12.9763 7.7308 13.1716 7.53553L16.3536 4.35355ZM0 4.5H16V3.5H0V4.5Z"
                fill="black"
              />
            </svg>
          </span>
        </a>
        <button className={s.news__wrapper_left_edit}>
          Изменения в графике работы
        </button>
      </div>
    </div>
  );
}

export default NewsCard;
